Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 28, 28, 512)       25600     
_________________________________________________________________
dropout (Dropout)            (None, 28, 28, 512)       0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 512)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 12, 12, 1024)      4719616   
_________________________________________________________________
dropout_1 (Dropout)          (None, 12, 12, 1024)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 6, 6, 1024)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 4, 4, 1024)        9438208   
_________________________________________________________________
dropout_2 (Dropout)          (None, 4, 4, 1024)        0         
_________________________________________________________________
flatten (Flatten)            (None, 16384)             0         
_________________________________________________________________
dense (Dense)                (None, 256)               4194560   
_________________________________________________________________
dense_1 (Dense)              (None, 10)                2570      
=================================================================
Total params: 18,380,554
Trainable params: 18,380,554
Non-trainable params: 0