Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 28, 28, 256)       20992     
_________________________________________________________________
dropout (Dropout)            (None, 28, 28, 256)       0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 256)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 12, 12, 512)       1180160   
_________________________________________________________________
dropout_1 (Dropout)          (None, 12, 12, 512)       0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 6, 6, 512)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 4, 4, 512)         2359808   
_________________________________________________________________
dropout_2 (Dropout)          (None, 4, 4, 512)         0         
=================================================================
Total params: 3,560,960
Trainable params: 3,560,960
Non-trainable params: 0
_________________________________________________________________